module CareerTests
  
  class Enneagram < CareerTests::Base
    
    Affirmative_Label = "是这样的"
    Negative_Label = "不是这样"
    
    
    def name
      "九型人格测试"
    end
    
    def questions
      results = [
        [
          "",
          ""
        ]
      ]
      
      
      [
        [10, "我很容易迷惑"],
        [20, "我不想成为一个喜欢批评的人,但很难做到"],
        [30, "我喜欢研究宇宙的道理,哲理"],
        [40, "我很注意自己是否年轻,因为那是找乐子的本钱"],
        [50, "我喜欢独自自主,一切都靠自己"],
        [60, "当我有困难时，我会试着不让人知道"],
        [70, "被人误解对我而言是一件十分痛苦的事"],
        [80, "施比受会给我更大的满足感"],
        [90, "我常常设想最糟的结果而使自己陷入苦恼中"],
        [100, "我常常试探或考验朋友,伴侣的忠诚"],
        [110, "我看不起那些不像我一样坚强的人,有时我会用种种方式羞辱他们"],
        [120, "身体上的舒适对我非常重要"],
        [130, "我能触碰生活中的悲伤和不幸"],
        [140, "别人不能完成他的分内事,会令我失望和愤怒"],
        [150, "我时常拖延问题,不去解决"],
        [160, "我喜欢戏剧性,多彩多姿的生活"],
        [170, "我认为自己非常不完善"],
        [180, "我对感官的需求特别强烈,喜欢美食,服装,身体的触觉刺激,并纵情享乐"],
        [190, "当别人请教我一些问题,我会巨细无遗地分析得很清楚"],
        [200, "我习惯推销自己,从不觉得难为情"],
        [210, "有时我会放纵和做出僭越的事"],
        [220, "帮助不到别人会让我觉得痛苦"],
        [230, "我不喜欢人家问我广泛,笼统的问题"],
        [240, "在某方面我有放纵的倾向(例如食物,药物等)"],
        [250, "我宁愿适应别人,包括我的伴侣,而不会反抗他们"],
        [260, "我最不喜欢的一件事就是虚伪"],
        [270, "我知错能改,但由于执著好强,周围的人还是感觉到压力"],
        [280, "我常觉得很多事情都很好玩,很有趣,人生真是快乐"],
        [290, "我有时很欣赏自己充满权威,有时又优柔寡断,依赖别人"],
        [300, "我习惯付出多于接受"],
        [310, "面对威胁时,我一是变得焦虑,一是对抗迎面而来的危险"],
        [320, "我通常是等别人来接近我,而不是我去就接近他们"],
        [330, "我喜欢当主角,希望得到大家的注意"],
        [340, "别人批评我,我也不会回应和辩解,因为我不想发生任何争执与冲突"],
        [350, "我有时期待别人的指导,有时却忽略别人的忠告径直去做我想做的事"],
        [360, "我经常忘记自己的需要"],
        [370, "在重大危机中,我通常能克服我对自己的质疑与内心的焦虑"],
        [380, "我是一个天生的推销员,说服别人对我来说是一件轻易的事"],
        [390, "我不相信一个我一直都无法了解的的人"],
        [400, "我爱依惯例行事,不大喜欢改变"],
        [410, "我很在乎家人,在家中表现得忠诚和包容"],
        [420, "我被动而优柔寡断"],
        [430, "我很有包容力,彬彬有礼,但跟人的感情互动不深"],
        [440, "我沉默寡言,好象不会关心别人似的"],
        [450, "当沉浸在工作或我擅长的领域时,别人会觉得我冷酷无情"],
        [460, "我常常保持警觉"],
        [470, "我不喜欢要对人尽义务的感觉"],
        [480, "如果不能完美的表态,我宁愿不说"],
        [490, "我的计划比我实际完成的还要多"],
        [500, "我野心勃勃,喜欢挑战和登上高峰的经验"],
        [510, "我倾向于独断专行并自己解决问题"],
        [520, "我很多时候感到被遗弃"],
        [530, "我常常表现得十分忧郁的样子,充满痛苦而且内向"],
        [540, "初见陌生人时,我会表现得很冷漠,高傲"],
        [550, "我的面部表情严肃而生硬"],
        [560, "我很飘忽,常常不知自己下一刻想要什么"],
        [570, "我常对自己挑剔,期望不断改善自己的缺点,以成为一个完美的人"],
        [580, "我感受特别深刻,并怀疑那些总是很快乐的人"],
        [590, "我做事有效率,也会找捷径,模仿力特强"],
        [600, "我讲理,重实用"],
        [610, "我有很强的创造天分和想象力,喜欢将事情重新整合"],
        [620, "我不要求得到太多的注意力"],
        [630, "我喜欢每件事都井然有序,但别人会认为我过分执著"],
        [640, "我渴望拥有完美的心灵伴侣"],
        [650, "我常夸耀自己,对自己的能力十分有信心"],
        [660, "如果周遭的人行为太过分时,我准会让他难堪"],
        [670, "我外向,精力充沛,喜欢不断追求成就,这使我的自我感觉十分良好"],
        [680, "我是一位忠实的朋友和伙伴"],
        [690, "我知道如何让别人喜欢我"],
        [700, "我很少看到别人的功劳和好处"],
        [710, "我很容易知道别人的功劳和好处"],
        [720, "我嫉妒心强,喜欢跟别人比较"],
        [730, "我对别人做的事总是不放心,批评一番后,自己会动手再做"],
        [740, "别人会说我常常带着面具做人"],
        [750, "有时我会激怒对方,引来莫名其妙的吵架,其实我是想试探对方爱不爱我"],
        [760, "我会极力保护我所爱的人"],
        [770, "我常常可以保持兴奋的情绪"],
        [780, "我只喜欢与有趣的人交友,对一些闷蛋却懒得交往,即使他们看来很有深度"],
        [790, "我常往外跑,四处帮助别人"],
        [800, "有时我会讲求效率而牺牲完美和原则"],
        [810, "我似乎不太懂得幽默,没有弹性"],
        [820, "我待人热情而有耐性"],
        [830, "在人群中我时常感到害羞和不安"],
        [840, "我喜欢效率,讨厌拖泥带水"],
        [850, "帮助别人达致快乐和成功是我重要的成就"],
        [860, "付出时,别人若不欣然接纳,我便会有挫折感"],
        [870, "我的肢体硬邦邦的,不习惯别人热情的付出"],
        [880, "我对大部分的社交集会不太有兴趣,除非那是我熟识的和喜爱的人"],
        [890, "很多时候我会有强烈的寂寞感"],
        [900, "人们很乐意向我表白他们所遭遇的问题"],
        [910, "我不但不会说甜言蜜语,而且别人会觉得我唠叨不停"],
        [920, "我常担心自由被剥夺,因此不爱作承诺"],
        [930, "我喜欢告诉别人我所做的事和所知的一切"],
        [940, "我很容易认同别人为我所做的事和所知的一切"],
        [950, "我要求光明正大,为此不惜与人发生冲突"],
        [960, "我很有正义感,有时会支持不利的一方"],
        [970, "我注重小节而效率不高"],
        [980, "我容易感到沮丧和麻木更多于愤怒"],
        [990, "我不喜欢那些侵略性或过度情绪化的人"],
        [1000, "我非常情绪化,一天的喜怒哀乐多变"],
        [1010, "我不想别人知道我的感受与想法,除非我告诉他们"],
        [1020, "我喜欢刺激和紧张的关系,而不是稳定和依赖的关系"],
        [1030, "我很少用心去听别人的心情,只喜欢说说俏皮话和笑话"],
        [1040, "我是循规蹈矩的人,秩序对我十分有意义"],
        [1050, "我很难找到一种我真正感到被爱的关系"],
        [1060, "假如我想要结束一段关系,我不是直接告诉对方就是激怒他来让他离开我"],
        [1070, "我温和平静,不自夸,不爱与人竞争"],
        [1080, "我有时善良可爱,有时又粗野暴躁,很难捉摸"]
      ].each do |q|
        results[0] << [
          q[0],
          q[1],
          [
            10,
            Affirmative_Label
          ],
          [
            20,
            Negative_Label
          ]
        ]
      end
      
      results
    end
    
    def display_question_title(index, title)
      "#{index+1}. <span style='margin-left: 10px; font-size: 14px; font-weight: bold;'>#{title}</span>"
    end
    
    def display_category_title(index, title)
      ""
    end
    
    
    def result_template
      "/career_tests/results/enneagram/enneagram"
    end
    
    def side_template
      nil
    end
    
    def process_answer(answer)
      result = [
        # [type, count]
        [0, 0],
        [1, 0],
        [2, 0],
        [3, 0],
        [4, 0],
        [5, 0],
        [6, 0],
        [7, 0],
        [8, 0],
        [9, 0]
      ]
      
      mapping = result_mapping
      question_ids.each do |question_id|
        n = mapping[question_id][answer[question_id]]
        result[n][1] += 1
      end
      
      top_type = result[1..-1].sort{|x,y| y[1]<=>x[1]}[0][0]
      
      [top_type, type_names[top_type]]
    end
    
    
    
    private
    
    def type_names
      [
        "",
        "完美主义者",
        "給予者",
        "实干者",
        "悲情浪漫者",
        "观察者",
        "怀疑论者",
        "享乐主义者",
        "保护者",
        "调停者"
      ]
    end
    
    def result_mapping
      {
        10 => {
          "10" => 9,
          "20" => 0
        },
        20 => {
          "10" => 1,
          "20" => 0
        },
        30 => {
          "10" => 5,
          "20" => 0
        },
        40 => {
          "10" => 7,
          "20" => 0
        },
        50 => {
          "10" => 8,
          "20" => 0
        },
        60 => {
          "10" => 2,
          "20" => 0
        },
        70 => {
          "10" => 4,
          "20" => 0
        },
        80 => {
          "10" => 2,
          "20" => 0
        },
        90 => {
          "10" => 6,
          "20" => 0
        },
        100 => {
          "10" => 6,
          "20" => 0
        },
        110 => {
          "10" => 8,
          "20" => 0
        },
        120 => {
          "10" => 9,
          "20" => 0
        },
        130 => {
          "10" => 4,
          "20" => 0
        },
        140 => {
          "10" => 1,
          "20" => 0
        },
        150 => {
          "10" => 9,
          "20" => 0
        },
        160 => {
          "10" => 7,
          "20" => 0
        },
        170 => {
          "10" => 4,
          "20" => 0
        },
        180 => {
          "10" => 7,
          "20" => 0
        },
        190 => {
          "10" => 5,
          "20" => 0
        },
        200 => {
          "10" => 3,
          "20" => 0
        },
        210 => {
          "10" => 7,
          "20" => 0
        },
        220 => {
          "10" => 2,
          "20" => 0
        },
        230 => {
          "10" => 5,
          "20" => 0
        },
        240 => {
          "10" => 8,
          "20" => 0
        },
        250 => {
          "10" => 9,
          "20" => 0
        },
        260 => {
          "10" => 6,
          "20" => 0
        },
        270 => {
          "10" => 8,
          "20" => 0
        },
        280 => {
          "10" => 7,
          "20" => 0
        },
        290 => {
          "10" => 6,
          "20" => 0
        },
        300 => {
          "10" => 2,
          "20" => 0
        },
        310 => {
          "10" => 6,
          "20" => 0
        },
        320 => {
          "10" => 5,
          "20" => 0
        },
        330 => {
          "10" => 3,
          "20" => 0
        },
        340 => {
          "10" => 9,
          "20" => 0
        },
        350 => {
          "10" => 6,
          "20" => 0
        },
        360 => {
          "10" => 9,
          "20" => 0
        },
        370 => {
          "10" => 6,
          "20" => 0
        },
        380 => {
          "10" => 3,
          "20" => 0
        },
        390 => {
          "10" => 9,
          "20" => 0
        },
        400 => {
          "10" => 8,
          "20" => 0
        },
        410 => {
          "10" => 9,
          "20" => 0
        },
        420 => {
          "10" => 5,
          "20" => 0
        },
        430 => {
          "10" => 5,
          "20" => 0
        },
        440 => {
          "10" => 8,
          "20" => 0
        },
        450 => {
          "10" => 6,
          "20" => 0
        },
        460 => {
          "10" => 6,
          "20" => 0
        },
        470 => {
          "10" => 5,
          "20" => 0
        },
        480 => {
          "10" => 5,
          "20" => 0
        },
        490 => {
          "10" => 7,
          "20" => 0
        },
        500 => {
          "10" => 8,
          "20" => 0
        },
        510 => {
          "10" => 5,
          "20" => 0
        },
        520 => {
          "10" => 4,
          "20" => 0
        },
        530 => {
          "10" => 4,
          "20" => 0
        },
        540 => {
          "10" => 4,
          "20" => 0
        },
        550 => {
          "10" => 1,
          "20" => 0
        },
        560 => {
          "10" => 4,
          "20" => 0
        },
        570 => {
          "10" => 1,
          "20" => 0
        },
        580 => {
          "10" => 4,
          "20" => 0
        },
        590 => {
          "10" => 3,
          "20" => 0
        },
        600 => {
          "10" => 1,
          "20" => 0
        },
        610 => {
          "10" => 4,
          "20" => 0
        },
        620 => {
          "10" => 9,
          "20" => 0
        },
        630 => {
          "10" => 1,
          "20" => 0
        },
        640 => {
          "10" => 4,
          "20" => 0
        },
        650 => {
          "10" => 3,
          "20" => 0
        },
        660 => {
          "10" => 8,
          "20" => 0
        },
        670 => {
          "10" => 3,
          "20" => 0
        },
        680 => {
          "10" => 6,
          "20" => 0
        },
        690 => {
          "10" => 2,
          "20" => 0
        },
        700 => {
          "10" => 3,
          "20" => 0
        },
        710 => {
          "10" => 2,
          "20" => 0
        },
        720 => {
          "10" => 3,
          "20" => 0
        },
        730 => {
          "10" => 1,
          "20" => 0
        },
        740 => {
          "10" => 3,
          "20" => 0
        },
        750 => {
          "10" => 6,
          "20" => 0
        },
        760 => {
          "10" => 8,
          "20" => 0
        },
        770 => {
          "10" => 3,
          "20" => 0
        },
        780 => {
          "10" => 7,
          "20" => 0
        },
        790 => {
          "10" => 2,
          "20" => 0
        },
        800 => {
          "10" => 3,
          "20" => 0
        },
        810 => {
          "10" => 1,
          "20" => 0
        },
        820 => {
          "10" => 2,
          "20" => 0
        },
        830 => {
          "10" => 5,
          "20" => 0
        },
        840 => {
          "10" => 8,
          "20" => 0
        },
        850 => {
          "10" => 2,
          "20" => 0
        },
        860 => {
          "10" => 2,
          "20" => 0
        },
        870 => {
          "10" => 1,
          "20" => 0
        },
        880 => {
          "10" => 5,
          "20" => 0
        },
        890 => {
          "10" => 2,
          "20" => 0
        },
        900 => {
          "10" => 2,
          "20" => 0
        },
        910 => {
          "10" => 1,
          "20" => 0
        },
        920 => {
          "10" => 7,
          "20" => 0
        },
        930 => {
          "10" => 3,
          "20" => 0
        },
        940 => {
          "10" => 9,
          "20" => 0
        },
        950 => {
          "10" => 8,
          "20" => 0
        },
        960 => {
          "10" => 8,
          "20" => 0
        },
        970 => {
          "10" => 1,
          "20" => 0
        },
        980 => {
          "10" => 9,
          "20" => 0
        },
        990 => {
          "10" => 5,
          "20" => 0
        },
        1000 => {
          "10" => 4,
          "20" => 0
        },
        1010 => {
          "10" => 5,
          "20" => 0
        },
        1020 => {
          "10" => 1,
          "20" => 0
        },
        1030 => {
          "10" => 7,
          "20" => 0
        },
        1040 => {
          "10" => 1,
          "20" => 0
        },
        1050 => {
          "10" => 4,
          "20" => 0
        },
        1060 => {
          "10" => 1,
          "20" => 0
        },
        1070 => {
          "10" => 9,
          "20" => 0
        },
        1080 => {
          "10" => 9,
          "20" => 0
        }
      }
    end
    
  end

end

