module CareerTests
  
  class Mbti < Base
    
    def name
      "MBTI 行为风格测试"
    end
    
    def questions
      [
        [
          "哪一个答案最能贴切地描绘你一般的感受或行为？",
          "",
          [
            10,
            "当你要出外一整天，你会不会",
            [
              10,
              "计划你要做什么和在什么时候做，还是"
            ],
            [
              20,
              "说去就去"
            ]
          ],
          
          [
            20,
            "你认为自己是一个",
            [
              10,
              "较为随性而至的人，还是"
            ],
            [
              20,
              "较为有条理的人？"
            ]
          ],
          
          [
            30,
            "假如你是一位老师，你会选教",
            [
              10,
              "以事实为主的课程，或是"
            ],
            [
              20,
              "涉及理论的课程？"
            ]
          ],
          
          [
            40,
            "你通常",
            [
              10,
              "与人容易混熟，或是"
            ],
            [
              20,
              "比较沉静和矜持？"
            ]
          ],
          
          [
            50,
            "一般来说，你和哪些人比较合得来？",
            [
              10,
              "富于想象力的人，或是"
            ],
            [
              20,
              "现实的人"
            ]
          ],
          
          [
            60,
            "你是否经常让",
            [
              10,
              "你的情感支配你的理智，还是"
            ],
            [
              20,
              "你的理智主宰你的情感？"
            ]
          ],
          
          [
            70,
            "处理许多事情上，你会喜欢",
            [
              10,
              "凭兴所致行事，或是"
            ],
            [
              20,
              "按照计划行事？"
            ]
          ],
          
          [
            80,
            "你是否",
            [
              10,
              "容易让人了解，或是"
            ],
            [
              20,
              "难于让人了解？"
            ]
          ],
          
          [
            90,
            "按照程序做事，是否",
            [
              10,
              "合你心意，还是"
            ],
            [
              20,
              "令你感到束缚？"
            ]
          ],
          
          [
            100,
            "当你有一份特别的任务，你会喜欢",
            [
              10,
              "开始前小心组织计划，还是"
            ],
            [
              20,
              "边做边找须做什么？"
            ]
          ],
          
          [
            110,
            "在大多数情况下，你会选择",
            [
              10,
              "顺其自然，还是"
            ],
            [
              20,
              "按程序表做事？"
            ]
          ],
          
          [
            120,
            "大多数人会说你是一个",
            [
              10,
              "重视自我隐私的人，或是"
            ],
            [
              20,
              "非常坦率开放的人？"
            ]
          ],
          
          [
            130,
            "你宁愿被认为是一个",
            [
              10,
              "实事求是的人，还是"
            ],
            [
              20,
              "机灵的人？"
            ]
          ],
          
          [
            140,
            "在一大群人当中，通常是",
            [
              10,
              "你介绍大家认识，或是"
            ],
            [
              20,
              "别人介绍你？"
            ]
          ],
          
          [
            150,
            "你会跟哪些人做朋友？",
            [
              10,
              "常提出新主意的，还是"
            ],
            [
              20,
              "脚踏实地的"
            ]
          ],
          
          [
            160,
            "你倾向",
            [
              10,
              "重视感情多于逻辑，还是"
            ],
            [
              20,
              "重视逻辑多于情感？"
            ]
          ],
          
          [
            170,
            "你比较喜欢",
            [
              10,
              "坐观事情发展才做计划，还是"
            ],
            [
              20,
              "很早就做计划？"
            ]
          ],
          
          [
            180,
            "你喜欢花很多的时间",
            [
              10,
              "一个人独处，或是"
            ],
            [
              20,
              "和别人在一起？"
            ]
          ],
          
          [
            190,
            "与很多人在一起会否",
            [
              10,
              "令你活力倍增，或是"
            ],
            [
              20,
              "常常令你心力交瘁"
            ]
          ],
          
          [
            200,
            "你比较喜欢",
            [
              10,
              "很早便把约会、社交聚集等事情安排妥当，还是"
            ],
            [
              20,
              "无拘无束，看当时有什么好玩就做什么？"
            ]
          ],
          
          [
            210,
            "计划一个旅程时，你较喜欢",
            [
              10,
              "大部分时间都是跟当天的感觉行事，还是"
            ],
            [
              20,
              "事先知道大部分的日子会做什么？"
            ]
          ],
          
          [
            220,
            "在社交聚会中，你是否",
            [
              10,
              "有时感到烦闷，或是"
            ],
            [
              20,
              "常常乐在其中"
            ]
          ],
          
          [
            230,
            "你通常是否",
            [
              10,
              "和别人容易混熟，或是"
            ],
            [
              20,
              "趋向自处一隅？"
            ]
          ],
          
          [
            240,
            "哪些人会更吸引你？",
            [
              10,
              "一个思想敏捷非常聪颖的人，还是"
            ],
            [
              20,
              "实事求是，具丰富常识的人"
            ]
          ],
          
          [
            250,
            "在日常工作中，你会",
            [
              10,
              "颇为喜欢处理迫使你分秒必争的突发事件，或是"
            ],
            [
              20,
              "通常预先计划，以免要在压力下工作？"
            ]
          ],
          
          [
            260,
            "你认为别人一般",
            [
              10,
              "要花很长时间才认识你，或是"
            ],
            [
              20,
              "用很短的时间便认识你？"
            ]
          ]
        ],
        
        
        [
          "在下列同一对词语中，哪一个词语更合你心意？",
          "请你仔细想想这些词语的意义，而不要理会它们的字形或读音。",
          [
            270,
            "",
            [
              10,
              "注重隐私"
            ],
            [
              20,
              "坦率开放"
            ]
          ],
          
          [
            280,
            "",
            [
              10,
              "预先安排的"
            ],
            [
              20,
              "无计划的"
            ]
          ],
          
          [
            290,
            "",
            [
              10,
              "抽象"
            ],
            [
              20,
              "具体"
            ]
          ],
          
          [
            300,
            "",
            [
              10,
              "温柔"
            ],
            [
              20,
              "坚定"
            ]
          ],
          
          [
            310,
            "",
            [
              10,
              "思考"
            ],
            [
              20,
              "感受"
            ]
          ],
          
          [
            320,
            "",
            [
              10,
              "事实"
            ],
            [
              20,
              "意念"
            ]
          ],
          
          [
            330,
            "",
            [
              10,
              "冲动"
            ],
            [
              20,
              "决定"
            ]
          ],
          
          [
            340,
            "",
            [
              10,
              "热衷"
            ],
            [
              20,
              "文静"
            ]
          ],
          
          [
            350,
            "",
            [
              10,
              "文静"
            ],
            [
              20,
              "外向"
            ]
          ],
          
          [
            360,
            "",
            [
              10,
              "有系统"
            ],
            [
              20,
              "随意"
            ]
          ],
          
          [
            370,
            "",
            [
              10,
              "理论"
            ],
            [
              20,
              "肯定"
            ]
          ],
          
          [
            380,
            "",
            [
              10,
              "敏感"
            ],
            [
              20,
              "公正"
            ]
          ],
          
          [
            390,
            "",
            [
              10,
              "令人信服"
            ],
            [
              20,
              "感人的"
            ]
          ],
          
          [
            400,
            "",
            [
              10,
              "声明"
            ],
            [
              20,
              "概念"
            ]
          ],
          
          [
            410,
            "",
            [
              10,
              "不受约束"
            ],
            [
              20,
              "预先安排"
            ]
          ],
          
          [
            420,
            "",
            [
              10,
              "矜持"
            ],
            [
              20,
              "健谈"
            ]
          ],
          
          [
            430,
            "",
            [
              10,
              "有条不紊"
            ],
            [
              20,
              "不拘小节"
            ]
          ],
          
          [
            440,
            "",
            [
              10,
              "意念"
            ],
            [
              20,
              "实况"
            ]
          ],
          
          [
            450,
            "",
            [
              10,
              "同情怜悯"
            ],
            [
              20,
              "远见"
            ]
          ],
          
          [
            460,
            "",
            [
              10,
              "利益"
            ],
            [
              20,
              "祝福"
            ]
          ],
          
          [
            470,
            "",
            [
              10,
              "务实的"
            ],
            [
              20,
              "理论的"
            ]
          ],
          
          [
            480,
            "",
            [
              10,
              "朋友不多"
            ],
            [
              20,
              "朋友众多"
            ]
          ],
          
          [
            490,
            "",
            [
              10,
              "有系统"
            ],
            [
              20,
              "即兴"
            ]
          ],
          
          [
            500,
            "",
            [
              10,
              "富想象的"
            ],
            [
              20,
              "以事论事"
            ]
          ],
          
          [
            510,
            "",
            [
              10,
              "亲切的"
            ],
            [
              20,
              "客观的"
            ]
          ],
          
          [
            520,
            "",
            [
              10,
              "客观的"
            ],
            [
              20,
              "热情的"
            ]
          ],
          
          [
            530,
            "",
            [
              10,
              "建造"
            ],
            [
              20,
              "发明"
            ]
          ],
          
          [
            540,
            "",
            [
              10,
              "文静"
            ],
            [
              20,
              "爱合群"
            ]
          ],
          
          [
            550,
            "",
            [
              10,
              "理论"
            ],
            [
              20,
              "事实"
            ]
          ],
          
          [
            560,
            "",
            [
              10,
              "富同情"
            ],
            [
              20,
              "合逻辑"
            ]
          ],
          
          [
            570,
            "",
            [
              10,
              "具分析力"
            ],
            [
              20,
              "多愁善感"
            ]
          ],
          
          [
            580,
            "",
            [
              10,
              "合情合理"
            ],
            [
              20,
              "令人着迷"
            ]
          ]
        ],
        
        
        [
          "哪一个答案最能贴切地描绘你一般的感受或行为？",
          "",
          [
            590,
            "当你要在一个星期内完成一个大项目，你在开始的时候就会",
            [
              10,
              "把要做的不同工序依次列出，或是"
            ],
            [
              20,
              "马上动工？"
            ]
          ],
          
          [
            600,
            "在社交场合中，你经常会感到",
            [
              10,
              "与某些人很难打开话匣儿和保持对话，或是"
            ],
            [
              20,
              "与多数人都能从容地长谈？"
            ]
          ],
          
          [
            610,
            "要做许多人也做的事，你比较喜欢",
            [
              10,
              "按照一般认可的方法去做，或是"
            ],
            [
              20,
              "构想一个自己的方法？"
            ]
          ],
          
          [
            620,
            "你刚认识的朋友能否说出你的兴趣？",
            [
              10,
              "马上可以，或是"
            ],
            [
              20,
              "要待他们真正了解你之后才可以"
            ]
          ],
          
          [
            630,
            "你通常教喜欢的科目是",
            [
              10,
              "讲授概念和原则的，或是"
            ],
            [
              20,
              "讲授事实和数据的？"
            ]
          ],
          
          [
            640,
            "哪个是较高的赞誉？获称许为",
            [
              10,
              "一贯感性的人，或是"
            ],
            [
              20,
              "一贯理性的人"
            ]
          ],
          
          [
            650,
            "你认为按照程序表做事",
            [
              10,
              "有时是需要的，但一般来说你不大喜欢这样做，还是"
            ],
            [
              20,
              "大多数情况下是有帮助而且是你喜欢做的？"
            ]
          ],
          
          [
            660,
            "和一群人在一起，你通常会选",
            [
              10,
              "跟你很熟悉的某个人谈话，还是"
            ],
            [
              20,
              "参与大伙儿的谈话？"
            ]
          ],
          
          [
            670,
            "在社交聚会中，你会",
            [
              10,
              "是说话很多的一个，还是"
            ],
            [
              20,
              "让别人多说话"
            ]
          ],
          
          [
            680,
            "把在周末期间要完成的事列成清单，这个主意会",
            [
              10,
              "合你意，或是"
            ],
            [
              20,
              "使你提不起劲？"
            ]
          ],
          
          [
            690,
            "哪个是较高的赞誉，获称许为",
            [
              10,
              "能干的，或是"
            ],
            [
              20,
              "富有同情心的"
            ]
          ],
          
          [
            700,
            "你通常喜欢",
            [
              10,
              "事先安排你的社交约会，或是"
            ],
            [
              20,
              "随兴之所至做事"
            ]
          ],
          
          [
            710,
            "总的来说，要做一个大型作业时，你会选",
            [
              10,
              "边做边想该做什么，或是"
            ],
            [
              20,
              "首先把工作按步细分"
            ]
          ],
          
          [
            720,
            "你能否滔滔不绝地与人聊天？",
            [
              10,
              "只限于跟你有共同兴趣的人，或是"
            ],
            [
              20,
              "几乎跟任何人都可以"
            ]
          ],
          
          [
            730,
            "你会",
            [
              10,
              "跟随一些证明有效的方法，还是"
            ],
            [
              20,
              "分析还有什么毛病，及针对尚未解决的难题？"
            ]
          ],
          
          [
            740,
            "为乐趣而阅读时，你会",
            [
              10,
              "喜欢奇特或创新的表达方式，还是"
            ],
            [
              20,
              "喜欢作者直话直说"
            ]
          ],
          
          [
            750,
            "你宁愿替哪一类上司（或者老师）工作？",
            [
              10,
              "天性纯良，但常常前后不一的，还是"
            ],
            [
              20,
              "言辞尖锐但永远合逻辑"
            ]
          ],
          
          [
            760,
            "你做事多数是",
            [
              10,
              "按当天心情去做，还是"
            ],
            [
              20,
              "照拟好的程序表去做"
            ]
          ],
          
          [
            770,
            "你是否",
            [
              10,
              "可以与任何人按需要从容地交谈，或是"
            ],
            [
              20,
              "只是对某些人或在某种情况下才可以畅所欲言"
            ]
          ],
          
          [
            780,
            "要作决定时，你认为比较重要的是",
            [
              10,
              "据实施衡量，还是"
            ],
            [
              20,
              "考虑他人的感受和意见？"
            ]
          ]
        ],
        
        
        [
          "在下列每一对词语中，哪一个词语更适合你心意？",
          "请你仔细想象这些词语的意义，而不要理会它们的字形或读音",
          [
            790,
            "",
            [
              10,
              "想象的"
            ],
            [
              20,
              "真实的"
            ]
          ],
          
          [
            800,
            "",
            [
              10,
              "仁慈慷慨的"
            ],
            [
              20,
              "意志坚定的"
            ]
          ],
          
          [
            810,
            "",
            [
              10,
              "公正的"
            ],
            [
              20,
              "有关怀心的"
            ]
          ],
          
          [
            820,
            "",
            [
              10,
              "制作"
            ],
            [
              20,
              "设计"
            ]
          ],
          
          [
            830,
            "",
            [
              10,
              "可能性"
            ],
            [
              20,
              "必然性"
            ]
          ],
          
          [
            840,
            "",
            [
              10,
              "温柔"
            ],
            [
              20,
              "力量"
            ]
          ],
          
          [
            850,
            "",
            [
              10,
              "实际"
            ],
            [
              20,
              "多愁善感"
            ]
          ],
          
          [
            860,
            "",
            [
              10,
              "制造"
            ],
            [
              20,
              "创造"
            ]
          ],
          
          [
            870,
            "",
            [
              10,
              "新颖的"
            ],
            [
              20,
              "已知的"
            ]
          ],
          
          [
            880,
            "",
            [
              10,
              "同情"
            ],
            [
              20,
              "分析"
            ]
          ],
          
          [
            890,
            "",
            [
              10,
              "坚持己见"
            ],
            [
              20,
              "温柔有爱心"
            ]
          ],
          
          [
            900,
            "",
            [
              10,
              "具体的"
            ],
            [
              20,
              "抽象的"
            ]
          ],
          
          [
            910,
            "",
            [
              10,
              "全心投入"
            ],
            [
              20,
              "有决心的"
            ]
          ],
          
          [
            920,
            "",
            [
              10,
              "能干"
            ],
            [
              20,
              "仁慈"
            ]
          ],
          
          [
            930,
            "",
            [
              10,
              "实际"
            ],
            [
              20,
              "创新"
            ]
          ]
        ]
      ]
    end
    
    def display_question_title(index, title)
      "<b>#{index+1}. #{title}</b>"
    end
    
    def display_category_title(index, title)
      "第 #{index+1} 部分: #{title}"
    end
    
    def category_title_bg_color
      "F0F3FA"
    end
    
    
    def result_template
      "/career_tests/results/mbti/mbti"
    end
    
    def side_template
      nil
    end
    
    def process_answer(answer)
      result = [
        0,  # 1 - E
        0,  # 2 - I
        
        0,  # 3 - N
        0,  # 4 - S
        
        0,  # 5 - F
        0,  # 6 - T
        
        0,  # 7 - J
        0   # 8 - P
      ]
      
      mapping = result_mapping
      flatten_questions.each do |q|
        question_id = q[0]
        n = mapping[question_id][answer[question_id]]
        result[n-1] += 1
      end
      
      c_1 = result[0] > result[1] ? "E" : "I"
      c_2 = result[2] > result[3] ? "N" : "S"
      c_3 = result[4] > result[5] ? "F" : "T"
      c_4 = result[6] > result[7] ? "J" : "P"
      kind = "#{c_1}#{c_2}#{c_3}#{c_4}"
      [kind, simple_result_descs[kind]]
    end
    
    
    
    private
    
    def simple_result_descs
      {
        # kind => [
        #   "desc",
        #   [job position list]
        # ]
        "ISTJ" => [
          "严肃、少言、依靠精力集中，通过全面性和可靠性获得成功。注重实践、有秩序、实事求是、有逻辑、现实、值得信赖。他们自己决定该做什么并不愿反对和干扰，并坚定不移地朝着目标前进，不易分心。喜欢将工作、家庭和生活都安排得井井有条。重视传统和忠诚。",
          [
            "首席信息系统执行官",
            "天文学家",
            "数据库管理",
            "会计",
            "房地产经纪人",
            "侦探",
            "行政管理",
            "信用分析师"
          ]
        ],
        
        "ISFJ" => [
          "少言、友善、有责任感和良知。坚定地致力于完成他们的义务。可以使任何项目和群体更加稳定。忠诚、体贴、周到、刻苦、精确，他们的兴趣通常不是技术性的。有洞察力，能对必要的细节有耐心，关心他人的感受。努力把工作和家庭环境营造得有序而温馨。",
          [
            "内科医生",
            "营养师",
            "图书/档案管理员",
            "室内装潢设计师",
            "客户服务专员",
            "记账员",
            "特殊教育教师",
            "酒店管理"
          ]
        ],
        
        "INFJ" => [
          "沉静地坚强、责任心强、关心他人、富创造力，坚持自己的价值观。全力投入自己的工作。因其坚定的原则而受尊重。寻求思想、关系、物质等之间的意义和联系。希望了解什么能够激励人，对人有很强的洞察力。对于怎样更好的服务大众有清晰的远景,别人可能会尊重和追随他们。在对于目标的实现过程中有计划而且果断坚定。",
          [
            "特殊教育教师",
            "建筑设计师",
            "培训经理/培训师",
            "职业策划咨询顾问",
            "心理咨询师",
            "网站编辑",
            "作家",
            "仲裁人"
          ]
        ],
        
        "INTJ" => [
          "具有创造性的思想，并大力推动他们自己的主意和目标。目光远大、能很快洞察到外界事物间的规律并形成长期的远景计划。一旦决定做一件事就会开始规划并直到完成为止。在吸引他们的领域,他们有很好的能力去组织工作并将其进行到底。不轻信、具批判性、独立性、有决心，对于自己和他人的能力和表现要求都非常高。",
          [
            "首席财政执行官",
            "知识产权律师",
            "设计工程师",
            "精神分析师",
            "心脏病专家",
            "媒体策划",
            "网络管理员",
            "建筑师"
          ]
        ],
        
        "ISTP" => [
          "是个安静的观察者直到有问题发生，就会马上行动。自制、以独有的好奇心和出人意料的有创意的幽默，观察和分析生活。分析事物运作的原理，对于原因和结果感兴趣，能从大量的信息中很快的找到关键的症结所在，用逻辑的方式处理问题，重视效率。",
          [
            "信息服务业经理",
            "计算机程序员",
            "警官",
            "软件开发员",
            "律师助理",
            "消防员",
            "私人侦探",
            "药剂师"
          ]
        ],
        
        "ISFP" => [
          "羞怯、友善、敏感、和谐、谦虚看待自己的能力。不喜欢争论和冲突，不将自己的观点和价值观强加于人。喜欢有自己的空间，喜欢能按照自己的时间表工作。一般说,无意于做领导工作,但对于自己的价值观和自己觉得重要的人非常忠诚，有责任心。他们享受眼前的乐趣,所以事情做完经常松懈而不愿让过度的紧迫和费事来破坏这种享受。",
          [
            "室内装潢设计师",
            "按摩师",
            "客户服务专员",
            "服装设计师",
            "厨师",
            "护士",
            "牙医",
            "旅游管理"
          ]
        ],
        
        "INFP" => [
          "沉稳的观察者、理想主义、忠实、希望外部的生活和自己内心的价值观是统一的。有求知欲, 很快能看到事情的可能性,能成为实现想法的催化剂。只要某种价值观不受到威胁,他们都善于适应、灵活、善于接受。愿意谅解别人和了解充分发挥人潜力的方法。对财富和周围的事物不太关心。",
          [
            "心理学家",
            "人力资源管理",
            "翻译",
            "大学教师（人文学科）",
            "社会工作者",
            "图书管理员",
            "服装设计师",
            "编辑/网站设计师"
          ]
        ],
        
        "INTP" => [
          "安静、内向、灵活、适应力强。喜欢理论性的和抽象的事物，热衷于思考而非社交活动。对于自己感兴趣的领域有超凡的集中精力和深度解决问题的能力。谋求他们的某些特别的爱好能得到运用的那些职业。多疑，有时会有点挑剔，喜欢分析。",
          [
            "软件设计师",
            "风险投资家",
            "法律仲裁人",
            "金融分析师",
            "大学教师（经济学）",
            "音乐家",
            "知识产权律师",
            "网站设计师"
          ]
        ],
        
        "ESTP" => [
          "擅长于现场解决问题，注重当前，自然不做作。喜欢行动,不喜多加解释。对任何的进展都感到高兴。往往喜好机械的东西和运动,享受和他人在一起的时刻。善应变、容忍、重实效，注重结果，觉得理论和抽象的解释非常无趣。最喜好能干好、能掌握、能分析、能合一的交际事物。学习新事物最有效的方式是通过亲身感受和练习，喜欢物质享受和时尚。",
          [
            "企业家",
            "股票经纪人",
            "保险经纪人",
            "土木工程师",
            "旅游管理",
            "职业运动员/教练",
            "电子游戏开发员",
            "房产开发商"
          ]
        ],
        
        "ESFP" => [
          "开朗、随和、友善、接受力强。热爱生活、人类和物质上的享受。喜欢和别人一起将事情做成功。喜欢行动并力促事情发生。他们了解正在发生的事情并积极参与。在工作中讲究常识和实用性，并使工作显得有趣。在需要丰富的知识和实际能力的情况下表现最佳。灵活、自然不做作，对于新的任何事物都能很快地适应，学习新事物最有效的方式是和他人一起尝试。",
          [
            "幼教老师",
            "公关专员",
            "职业策划咨询师",
            "旅游管理/导游",
            "促销员",
            "演员",
            "海洋生物学家",
            "销售"
          ]
        ],
        
        "ENFP" => [
          "热情洋溢、极富朝气、机敏、富于想象力，认为人生有很多的可能性。能很快地将事情和信息联系起来，然后很自信地根据自己的判断解决问题。常常依据他们自己的能力去即席成事, 而不是事先准备。几乎能够做他们感兴趣的任何事情，对任何困难都能迅速给出解决办法。总是需要得到别人的认可，也总是准备着给与他人赏识和帮助。经常能对他们想做的任何事情找到令人信服的理由。灵活、自然不做作，有很强的即兴发挥的能力，言语流畅。",
          [
            "广告客户管理",
            "管理咨询顾问",
            "演员",
            "平面设计师",
            "艺术指导",
            "公司团队培训师",
            "心理学家",
            "人力资源管理"
          ]
        ],
        
        "ENTP" => [
          "敏捷、睿智、有发明天才,长于许多事情。有激励别人的能力、机警、直言不讳。可能出于逗趣而争论问题的任何一个方面。在解决新的、具有挑战性的问题时机智而有策略，不喜欢例行公事，很少会用相同的方法做相同的事情，易把兴趣从一点转移到另一点。能够轻而易举地为他们的要求找到合乎逻辑的理由。善于找出理论上的可能性，然后再用战略的眼光分析。善于理解别人。",
          [
            "企业家",
            "投资银行家",
            "广告创意总监",
            "市场管理咨询顾问",
            "文案",
            "广播/电视主持人",
            "演员",
            "大学校长"
          ]
        ],
        
        "ESTJ" => [
          "实际、现实主义、果断、迅速行动起来执行决定。由于有天生的商业或机械学头脑，所以对抽象理论不感兴趣。善于将项目和人组织起来将事情完成，并尽可能用最有效率的方法得到结果，在实施计划时强而有力。喜欢组织和参与活动，通常能做优秀的领导人。注重日常的细节，有一套非常清晰的逻辑标准，有系统性地遵循，并希望他人也同样遵循。",
          [
            "公司首席执行官",
            "军官",
            "预算分析师",
            "药剂师",
            "房地产经纪人",
            "保险经纪人",
            "教师（贸易/工商类）",
            "物业管理"
          ]
        ],
        
        "ESFJ" => [
          "热心、健谈、受欢迎、有责任心、天生的合作者、积极的委员会成员。要求和谐并可能长于创造和谐，并为此果断地执行。喜欢和他人一起精确并及时地完成任务。事无巨细都会保持忠诚。能体察到他人在日常生活中的所需并竭尽全力帮助。在得到鼓励和赞扬时工作最出色。主要的兴趣在于那些对人们的生活有直接和明显的影响的事情。",
          [
            "房地产经纪人",
            "零售商",
            "护士",
            "理货员/采购",
            "按摩师",
            "运动教练",
            "饮食业管理",
            "旅游管理"
          ]
        ],
        
        "ENFJ" => [
          "敏感、热情、为他人着想、有责任心。真正地关心他人的所想所愿。善于发现他人的潜能，并希望能帮助他们实现。处理事情时尽量适当考虑别人的感情。能成为个人或群体成长和进步的催化剂。能提出建议或轻松而机智地领导小组讨论。喜社交、受欢迎、有同情心。对表扬和批评敏感。",
          [
            "广告客户管理",
            "杂志编辑",
            "公司培训师",
            "电视制片人",
            "市场专员",
            "作家",
            "社会工作者",
            "人力资源管理"
          ]
        ],
        
        "ENTJ" => [
          "直率、果断, 有天生的领导能力。能很快看到公司/组织程序和政策中的不合理性和低效能性，发展并实施有效和全面的系统来解决问题。善于做长期的计划和目标的设定。长于需要论据和机智谈吐的任何事情, 如公开演讲之类。通常见多识广，博览群书，喜欢拓广自己的知识面并将此分享给他人。在陈述自己的想法时非常强而有力。",
          [
            "公司首席执行官",
            "管理咨询顾问",
            "政治家",
            "房产开发商",
            "教育咨询顾问",
            "投资顾问",
            "法官"
          ]
        ]
      }
    end
    
    def result_mapping
      {
        10 => {
          "10" => 7,
          "20" => 8
        },
        20 => {
          "10" => 8,
          "20" => 7
        },
        30 => {
          "10" => 4,
          "20" => 3
        },
        40 => {
          "10" => 1,
          "20" => 2
        },
        50 => {
          "10" => 3,
          "20" => 4
        },
        60 => {
          "10" => 5,
          "20" => 6
        },
        70 => {
          "10" => 8,
          "20" => 7
        },
        80 => {
          "10" => 1,
          "20" => 2
        },
        90 => {
          "10" => 7,
          "20" => 8
        },
        100 => {
          "10" => 7,
          "20" => 8
        },
        110 => {
          "10" => 8,
          "20" => 7
        },
        120 => {
          "10" => 2,
          "20" => 1
        },
        130 => {
          "10" => 4,
          "20" => 3
        },
        140 => {
          "10" => 1,
          "20" => 2
        },
        150 => {
          "10" => 3,
          "20" => 4
        },
        160 => {
          "10" => 5,
          "20" => 6
        },
        170 => {
          "10" => 8,
          "20" => 7
        },
        180 => {
          "10" => 2,
          "20" => 1
        },
        190 => {
          "10" => 1,
          "20" => 2
        },
        200 => {
          "10" => 7,
          "20" => 8
        },
        210 => {
          "10" => 8,
          "20" => 7
        },
        220 => {
          "10" => 2,
          "20" => 1
        },
        230 => {
          "10" => 1,
          "20" => 2
        },
        240 => {
          "10" => 3,
          "20" => 4
        },
        250 => {
          "10" => 8,
          "20" => 7
        },
        260 => {
          "10" => 2,
          "20" => 1
        },
        270 => {
          "10" => 2,
          "20" => 1
        },
        280 => {
          "10" => 7,
          "20" => 8
        },
        290 => {
          "10" => 3,
          "20" => 4
        },
        300 => {
          "10" => 5,
          "20" => 6
        },
        310 => {
          "10" => 6,
          "20" => 5
        },
        320 => {
          "10" => 4,
          "20" => 3
        },
        330 => {
          "10" => 8,
          "20" => 7
        },
        340 => {
          "10" => 1,
          "20" => 2
        },
        350 => {
          "10" => 2,
          "20" => 1
        },
        360 => {
          "10" => 7,
          "20" => 8
        },
        370 => {
          "10" => 3,
          "20" => 4
        },
        380 => {
          "10" => 5,
          "20" => 6
        },
        390 => {
          "10" => 6,
          "20" => 5
        },
        400 => {
          "10" => 4,
          "20" => 3
        },
        410 => {
          "10" => 8,
          "20" => 7
        },
        420 => {
          "10" => 2,
          "20" => 1
        },
        430 => {
          "10" => 7,
          "20" => 8
        },
        440 => {
          "10" => 3,
          "20" => 4
        },
        450 => {
          "10" => 5,
          "20" => 6
        },
        460 => {
          "10" => 6,
          "20" => 5
        },
        470 => {
          "10" => 4,
          "20" => 3
        },
        480 => {
          "10" => 2,
          "20" => 1
        },
        490 => {
          "10" => 7,
          "20" => 8
        },
        500 => {
          "10" => 3,
          "20" => 4
        },
        510 => {
          "10" => 5,
          "20" => 6
        },
        520 => {
          "10" => 6,
          "20" => 5
        },
        530 => {
          "10" => 4,
          "20" => 3
        },
        540 => {
          "10" => 2,
          "20" => 1
        },
        550 => {
          "10" => 3,
          "20" => 4
        },
        560 => {
          "10" => 5,
          "20" => 6
        },
        570 => {
          "10" => 6,
          "20" => 5
        },
        580 => {
          "10" => 4,
          "20" => 3
        },
        590 => {
          "10" => 7,
          "20" => 8
        },
        600 => {
          "10" => 2,
          "20" => 1
        },
        610 => {
          "10" => 4,
          "20" => 3
        },
        620 => {
          "10" => 1,
          "20" => 2
        },
        630 => {
          "10" => 3,
          "20" => 4
        },
        640 => {
          "10" => 5,
          "20" => 6
        },
        650 => {
          "10" => 8,
          "20" => 7
        },
        660 => {
          "10" => 2,
          "20" => 1
        },
        670 => {
          "10" => 1,
          "20" => 2
        },
        680 => {
          "10" => 7,
          "20" => 8
        },
        690 => {
          "10" => 6,
          "20" => 5
        },
        700 => {
          "10" => 7,
          "20" => 8
        },
        710 => {
          "10" => 8,
          "20" => 7
        },
        720 => {
          "10" => 2,
          "20" => 1
        },
        730 => {
          "10" => 4,
          "20" => 3
        },
        740 => {
          "10" => 3,
          "20" => 4
        },
        750 => {
          "10" => 5,
          "20" => 6
        },
        760 => {
          "10" => 8,
          "20" => 7
        },
        770 => {
          "10" => 1,
          "20" => 2
        },
        780 => {
          "10" => 6,
          "20" => 5
        },
        790 => {
          "10" => 3,
          "20" => 4
        },
        800 => {
          "10" => 5,
          "20" => 6
        },
        810 => {
          "10" => 6,
          "20" => 5
        },
        820 => {
          "10" => 4,
          "20" => 3
        },
        830 => {
          "10" => 3,
          "20" => 4
        },
        840 => {
          "10" => 5,
          "20" => 6
        },
        850 => {
          "10" => 6,
          "20" => 5
        },
        860 => {
          "10" => 4,
          "20" => 3
        },
        870 => {
          "10" => 3,
          "20" => 4
        },
        880 => {
          "10" => 5,
          "20" => 6
        },
        890 => {
          "10" => 6,
          "20" => 5
        },
        900 => {
          "10" => 4,
          "20" => 3
        },
        910 => {
          "10" => 5,
          "20" => 6
        },
        920 => {
          "10" => 6,
          "20" => 5
        },
        930 => {
          "10" => 4,
          "20" => 3
        }
      }
    end
    
  end

end

