module CareerTests
  
  class SalesStyle < CareerTests::Base
    
    def name
      "销售风格测试"
    end
    
    def questions
      [
        [
          "",
          "",
          
          [
            10,
            "您的公司与某一主要竞争者分享您某一客户的业务。您的一些客户联系人愿意扩大与您公司的业务，但不是现在。他们公司的预算已经确定，他们说在未来6个月中采购量不会有变化。行动选择：",
            [
              10,
              "提前5个月确定一个得到最终承诺的日期。"
            ],
            [
              20,
              "对目前情况表示理解，并与客户做详细探讨，看看是否有任何其他方法或客户公司中是否有人可以出面，帮助缩短6个月的差距。"
            ],
            [
              30,
              "对客户表示理解，但指出您不能保证在6个月后给他们同样优惠的条件。"
            ],
            [
              40,
              "与客户再次确定这是唯一的障碍，如果他们说“是”，现在就要求他们下订单，但日期签到6个月以后，但不是真的用6个月的时间来处理。"
            ]
          ],
          
          [
            20,
            "您的客户原则上同意按报价进行购买，但由于这是个非常新的产品，他们不能肯定产品的性能是否符合宣传所说的。您被授予全权处理这项业务以获得订单，但手里又没有现成的用户可以推荐其参考。行动选择：",
            [
              10,
              "告诉客户最好的证明就是买下此产品亲自试一试，做一个简单的保证，然后直接要求他们下订单。"
            ],
            [
              20,
              "给予某种形式的担保或保证。"
            ],
            [
              30,
              "在客户有意大量订购时，提供该产品样品让客户使用。"
            ],
            [
              40,
              "询问客户，他们希望您和您的公司如何才能帮助他们相信产品性能将如所宣传的一样。"
            ]
          ],
          
          [
            30,
            "您刚加入公司不久，您的前任去了竞争对手那里，但仍然与原公司的老客户保持联系。在您第一次拜访一重要客户的会谈中，他们对您公司的服务提出了尖锐批评，对一些事情表示非常挑剔。您意识到是您的前任掺和在其中，将所有问题及缺点进行了夸大。行动选择：",
            [
              10,
              "尽量有礼貌地指出，可能您的前任有些夸张，实际上问题并没有这么严重。"
            ],
            [
              20,
              "倾听，并记录下客户提出的所有批评，告诉他们你会对此进行调查，并尽快做出解释。"
            ],
            [
              30,
              "尽可能回避所有批评，继续与客户进行会谈，假装什么批评意见都不存在。"
            ],
            [
              40,
              "将这些批评和问题一一罗列，尽全力逐个予以答复。"
            ]
          ],
          
          [
            40,
            "过去的6个月中，某客户曾多次表示要扩大与您公司的业务，然而，尽管您一再努力，他们还是迟迟没有行动。在与他们最后的谈话中您了解到他们的确很有兴趣与您公司合作，但需要先向他们的经理汇报。就在这时，那位经理走进房间，并开始与您的联系人讨论起一些不紧急的事项。行动选择：",
            [
              10,
              "感谢与您会谈的员工，并表示您希望能尽快得到他们的答复，告辞离开(留给他们直接向经理汇报的机会)。"
            ],
            [
              20,
              "向经理作自我介绍，然后简明扼要说明情况(至少这样您可以确定经理得到了正确的信息)。"
            ],
            [
              30,
              "高声地问与您会谈的员工，这位是否就是他们谈到的那位经理，然后等待他们下步的行动。"
            ],
            [
              40,
              "问与您会谈的员工，是否想让您来回答那位经理可能会提出的任何问题，以节省大家的时间。尽力利用这个机会做自我介绍，但又不能显得“鲁莽”，然后询问他们对有关问题的感觉、偏向及重点。"
            ]
          ],
          
          [
            50,
            "在与某一小公司的营销总监会面了几次以后，他们最后承认很欣赏您公司的服务，也正准备下单购买。这位营销总监以“谈判高手”而著称，他拿着您公司提供的报价单向您指出，其价格与竞争对手相比要高了很多，但质量上却没有太大的差别。您心里明知已经无法再降低价格了，但被告知“没有折扣  没有交易”。行动选择：",
            [
              10,
              "强调您的公司提供的服务质量高而且价格公道，而购买廉价的服务实际上并不能真正地节省。"
            ],
            [
              20,
              "重复您公司服务的优势，强调其物超所值；解释您的公司无法提供折扣，你们只能根据价格目录作交易。"
            ],
            [
              30,
              "打电话给您的经理，询问在此情况下是否可以以给予特别让步以完成淡判，获得订单。"
            ],
            [
              40,
              "告诉这位销售总监，你理解他希望得到个更好的价格，而且目前的谈判已非常艰苦---但您需要时间考虑，考虑好之后会再与他们联系。"
            ]
          ],
          
          [
            60,
            "到目前为止您的产品介绍看来进行得很顺利，这时您意识到与您谈话的经理事实上并没有权利决定进一步的需求，只有他的上司才有最终决定权。但这位经理并没有承认这一点，始终在充“大佬”。此外，您还发现，该经理与他的上司之问的关系并不是那么和睦。行动选择：",
            [
              10,
              "礼貌但迅速地结束讨论，然后尽力安排与其上司的单独会面。"
            ],
            [
              20,
              "从他那儿取得原则上的承诺，然后建议您个人将从“有关决策人”那儿取得正式的承诺。"
            ],
            [
              30,
              "尽可能开诚布公地讨论他与他上司之间的组织架构关系，提出需要他们同时参与。"
            ],
            [
              40,
              "将注意力放在如何有效地向这位经理推销产品，这样在您离开后他可以与他的上司做同样的说服。"
            ]
          ],
          
          [
            70,
            "在多次努力后，你终于见到了一个重要的客户，他们此前一直采用竞争对手的产品。该客户执意谈论许多事情，却对你的公司的相关产品和他们对此的需求闭口不提。你一直想让他们转到这个话题上，但没有成功。见面的时间即将结束，如果你再不动身，就会错过与下一个客户见面的机会。行动选择：",
            [
              10,
              "继续倾听，因为他们迟早会谈到正事上来。如果有必要，可以打电活给下一个客户，为约会迟到表示道歉。"
            ],
            [
              20,
              "礼貌地结束这次谈话；将样品、资料等等留下，说您会打电话再约时间。"
            ],
            [
              30,
              "告诉客户，您现在必须离开了，直接向他们询问希望你如何来做下一步。"
            ],
            [
              40,
              "直接要求客户做出对您公司有利之承诺。"
            ]
          ],
          
          [
            80,
            "您已经向一些客户对您的产品做了推销介绍，认为进行得顺利。但是，在您介绍完并离开房间后他们进行了简短的讨论，然后把您叫回房间被告知他们无法在当天作出决定。您必须立即决定如何回应。行动选择：",
            [
              10,
              "“很明显，我刚才的介绍没有完全打消你们的顾虑及怀疑。对此我表示抱歉你们是否可以告诉我，这些顾虑和怀疑是什么?”"
            ],
            [
              20,
              "感谢他们宝贵的时间和耐心，在会后联络其中与您关系最好的客户。了解是否有您没能够解决的问题。然后，给参加会议的每一客户发一份会议纪要，并对“隐藏”的问题做出答复。"
            ],
            [
              30,
              "“我十分理解，你们需要时间来做出此重要决定。我希望能尽快得到你们的答复。”"
            ],
            [
              40,
              "“我非常理解你们的处境，但由于本公司工作安排的压力，我必须事先做出计划；我是否可以暂时为你们下订单，并在几天后等待你们的正式确认?”"
            ]
          ],
          
          [
            90,
            "您接手一重要客户，并一直试着与其财务总监联系。您终于接通了她的电话，但她听上去心不在焉。当您提议确定会面的时间同期时，她说：“听起来不错，如果像你所说的那样，所有技术人员都觉得不错，我也非常有兴趣。可是，我希望您能事先给我一份建议书，这样在我有空的时候可以先研究一下。但现在好像急了点。”行动选择：",
            [
              10,
              "同意为她做建议书，并答应在一周内再与她电话联系。"
            ],
            [
              20,
              "向她解释，虽然你可以为她做出建议书，但这不能完全回答她的问题或解释您的服务，因而拜访还是非常必要的。建议安排另一个会面的日期和时间。"
            ],
            [
              30,
              "对她的处境表示理解，说明如果能与她面对面地介绍公司服务、解释一些问题要比她自己读建议书来得快，从而可以节省她的时间。请她建议一个会面的日期和时间。"
            ],
            [
              40,
              "在电话里询问有关她公司及对您能提供的产品的需求。然后亲自写一封“销售”信给她，并附上建议书，这样她更有可能会主动答复。"
            ]
          ],
          
          [
            100,
            "您事先打电话约见一个关系很好的采购经理。你被带到他的办公室，但只见到他的助理，一位能干、雄心勃勃的年轻女士。她告诉您那位经理突然被送入医院，出院时间未定：现在由她接管一切，但有些做法会和她的上司有所不同。她答应您可以在三周后打电话给她安排另一个会面，但现在她只有两分钟的时间听你讲话，因为她马上要与市场总监有一个紧急会议。行动选择：",
            [
              10,
              "利用这个机会强调，一旦她的公司大幅增加与您公司之间的业务往来，所带来的优点。"
            ],
            [
              20,
              "询问这个变化是否给她造成任何问题或麻烦；表示愿意为她提供一切帮助使她目前的工作更为轻松顺利。"
            ],
            [
              30,
              "提议你会等她忙完这一阵后，再联络您有关对您公司产品的需求。"
            ],
            [
              40,
              "有意不谈业务；对她的处境表示同情，注意建立起关系来。"
            ]
          ],
          
          [
            110,
            "一个重要的买家非常麻烦，总是为了这样那样的小事而争论不休。在一个似乎很成功的会谈后，他提出要一份正式报价。收到报价的那个早上，他打电话给您，非常恼怒地指责您“企图占他公司的便宜”，他声称当时双方达成协议是3，750元，而现在的报价上却写着3900元。行动选择：",
            [
              10,
              "您知道像此类复杂的问题是无法在电话里解决的。于是您符应他会亲自前去解决问题。"
            ],
            [
              20,
              "向他表示抱歉，解释你可能当初在他办公室搞错了，并希望他能接受那个较高的报价。"
            ],
            [
              30,
              "基于您已经在这份订单上付出了很多时间和精力，况且150的差别也不是很大，所以您就同意略低的那个价格。您说话的语气要流露出这个低价格已损害到你公司的利益，你做出此止步完全是因为他是个重要客户。"
            ],
            [
              40,
              "在电话中有礼貌但立场明确，显示出您听够了他的抱怨等等。告诉他你对那次讨论作了纪录，3,900元确实足他最后同意的价格，您现在已见法再改变。"
            ]
          ],
          
          [
            120,
            "您知道有一新产品可以给您的客户带来效益，但在您有任何进展前您必须联系到客户公司的总经理。您给他打的所有电话均转到其私人助理那里。到目前为止，您既没能与其总经理直接通话，也没能够让其私人助理为您确定一个拜访时间，她要么说总经理太忙，未来4周内没空见任何人，要么说他在会议中无法与您说话。行动选择：",
            [
              10,
              "直接给其总经理写一封“机密”介绍信函。"
            ],
            [
              20,
              "不经预约，突然造访客户；尽可能见到那位经理，如果不行，至少与他的助理确定拜访经理时间；让他相信你能够帮助其公司，因此应该安排会面。"
            ],
            [
              30,
              "再试次通过电话联系那位经理：如果他的助理再次拒绝您，就比较强硬地告诉她这件事只能与经理讨论，而他显然不可能每天每小时都这么忙。"
            ],
            [
              40,
              "再给其助理打电话，将整个情况解释给她听；向她询问有关情况，不要很明显地表现出想与她老板说话；随机应变，希望她能改变主意，给您一次会面机会。"
            ]
          ]
          
        ]
      ]
    end
    
    def display_question_title(index, title)
      "<b>情景 #{index+1}</b> - #{title}"
    end
    
    def display_category_title(index, title)
      ""
    end
    
    def display_option_title(index, title)
      "<b>#{(index+65).chr}</b>: #{title}"
    end
    
    
    def process_answer(answer)
      result = [
        0,  # 1 - 鼓吹
        0,  # 2 - 执行
        0,  # 3 - 大使
        0   # 4 - 顾问
      ]
      
      mapping = result_mapping
      flatten_questions.each do |q|
        question_id = q[0]
        n = mapping[question_id][answer[question_id]]
        result[n-1] += 1
      end
      
      [result, flatten_questions.size]
    end
    
    
    def result_template
      "/career_tests/results/sales_style/sales_style"
    end
    
    def side_template
      nil
    end
    
    
    
    private
    
    def result_mapping
      {
        10 => {
          "10" => 2,
          "20" => 3,
          "30" => 4,
          "40" => 1
        },
        20 => {
          "10" => 1,
          "20" => 4,
          "30" => 2,
          "40" => 3
        },
        30 => {
          "10" => 1,
          "20" => 3,
          "30" => 2,
          "40" => 4
        },
        40 => {
          "10" => 3,
          "20" => 1,
          "30" => 2,
          "40" => 4
        },
        50 => {
          "10" => 1,
          "20" => 4,
          "30" => 2,
          "40" => 3
        },
        60 => {
          "10" => 1,
          "20" => 4,
          "30" => 3,
          "40" => 2
        },
        70 => {
          "10" => 3,
          "20" => 4,
          "30" => 2,
          "40" => 1
        },
        80 => {
          "10" => 4,
          "20" => 3,
          "30" => 2,
          "40" => 1
        },
        90 => {
          "10" => 2,
          "20" => 1,
          "30" => 4,
          "40" => 3
        },
        100 => {
          "10" => 1,
          "20" => 4,
          "30" => 2,
          "40" => 3
        },
        110 => {
          "10" => 2,
          "20" => 4,
          "30" => 3,
          "40" => 1
        },
        120 => {
          "10" => 2,
          "20" => 4,
          "30" => 1,
          "40" => 3
        }
      }
    end
    
  end

end

