class Profession < ActiveRecord::Base
  
  def self.find(id)
    id ? id.to_s == "all" ? @@all : @@all[id-1] : ""
  end

  @@all = [
          "计算机硬件", # 1
          "计算机服务(系统、数据服务，维修)", # 2
          "通信/电信/网络设备", # 3
          "通信/电信运营、增值服务", # 4
          "互联网/电子商务", # 5
          "网络游戏", # 6
          "电子技术/半导体/集成电路", # 7
          "仪器仪表/工业自动化", # 8
          "会计/审计", # 9
          "金融/投资/证券", # 10
          "银行", # 11
          "保险", # 12
          "贸易/进出口", # 13
          "批发/零售", # 14
          "快速消费品(食品,饮料,化妆品)", # 15
          "服装/纺织/皮革", # 16
          "家具/家电/工艺品/玩具", # 17
          "办公用品及设备", # 18
          "机械/设备/重工", # 19
          "汽车及零配件", # 20
          "制药/生物工程", # 21
          "医疗/护理/保健/卫生", # 22
          "医疗设备/器械", # 23
          "广告", # 24
          "公关/市场推广/会展", # 25
          "影视/媒体/艺术", # 26
          "文字媒体/出版", # 27
          "印刷/包装", # 28
          "房地产开发", # 29
          "建筑与工程", # 30
          "家居/室内设计/装潢", # 31
          "物业管理/商业中心", # 32
          "中介服务", # 33
          "专业服务(咨询，人力资源)", # 34
          "检测/认证", # 35
          "法律", # 36
          "教育/培训", # 37
          "学术/科研", # 38
          "餐饮业", # 39
          "酒店/旅游", # 40
          "娱乐/休闲/体育", # 41
          "美容/保健", # 42
          "生活服务", # 43
          "交通/运输/物流", # 44
          "航天/航空", # 45
          "石油/化工/矿产", # 46
          "采掘业/冶炼", # 47
          "电力/水利", # 48
          "原材料和加工", # 49
          "政府", # 50
          "非盈利机构", # 51
          "环保", # 52
          "农业/渔业/林业", # 53
          "多元化业务集团公司" # 54
        ]

end
